//TODO  Правки/баги которые было бы круто устранить
// 1. Сейчас можно отправить новую задачу с пустым полем - нужен фикс //* done
// 2. Сделать компонент селекта и вынести логику туда
// 3. Сделать общий компонент для отрисовки графика и замени его на копипаст кода( продумать конфиг)
// 4. добавить возможность выбора городов

//TODO реализация основного функционала
// 1. Добавить селект с возможностью выбора типа диаграмм //* done
//! 2. подключить 2 апи по погоде и вывести их данные на график
//! 3. реализовать ui страницы аналитики
// - Сделать "вернуться назад" // *done
// - Добавить возможность вывода различных графиков //* done
// - Добавить возможность вывода графика  для тасок ( по дню, неделе, месяцу) //* done
// - Добавить отображение новых графиков для апи с погодой
// -реализовать так же различные виды диаграмм

//! поиграться с настройками canvas

//TODO  В самую последнюю очередь!
// 5. на последок: реализовать смену темы (светлая/темная)
//   - реализовать не просто темный фон но и изменение цвета текста/ инпутов и т д

//! 6. Сделать сохранение фильтров графиков в локал сторе что бы при перезагрузки страницы не сбрасывался график который был выбран ранее
